## :gear: Terraform run on `examples/demo2/terraform` <!-- tf-plan:examples/demo2/terraform -->

### 🚀 Terraform Plan Summary
- 🟢 **Add**: `3`
- 🔧 **Change**: `0`
- 🗑️ **Destroy**: `0`

✅ **Plan succeeded**

<details>
<summary>⚠️ Deprecations / Warnings (Click me)</summary>

> _No deprecations or warnings found._

</details>

<details>
<summary>📖 Details (Click me)</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.a will be created
  + resource "local_file" "a" {
      + content              = "a!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./a.bar"
      + id                   = (known after apply)
    }

  # local_file.b will be created
  + resource "local_file" "b" {
      + content              = "b!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./b.bar"
      + id                   = (known after apply)
    }

  # local_sensitive_file.test will be created
  + resource "local_sensitive_file" "test" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "./example.txt"
      + id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

🔗 [View run logs & artifacts](https://github.com/faviaitsolutionsab/cloudsmith/actions/runs/17878447805)

---
🧑‍💻 **Actor**: @aws-nitinjain
⚙️ **Event**: pull_request
📂 **Working Dir**: `examples/demo2/terraform`
🏗️ **Workflow**: PR — CloudSmith (self-test)
🔗 **Run Logs**: [View here](https://github.com/faviaitsolutionsab/cloudsmith/actions/runs/17878447805)
